package seminar2;

import java.util.ArrayList;
import java.util.List;

// Создать новый продукт на основе Product,
// Cделать ему хотя бы одно свойство
// включить в список продуктов вендинг машины
// переопределить toString для вывода нового поля

public class Main {

    public static void main(String[] args) {
        Zoo zoo = new Zoo();
        System.out.println("Can you hear from zoo");
        zoo.talk();
        System.out.println("Runable");
        zoo.run();
        System.out.println("SwimAble");
        zoo.swim();;
        System.out.println("Flyable");
        zoo.fly();

       
     


        
    }
   
}
